<?php
    $input=$_GET;
    $arr= array(
        0=>"Крыса",
        1=>"Бык",
        2=>"Тигр",
        3=>"Кролик",
        4=>"Дракон",
        5=>"Змея",
        6=>"Лошадь",
        7=>"Коза",
        8=>"Обезьяна",
        9=>"Петух",
        10=>"Собака",
        11=>"Свинья",
    );
    foreach ($input as $val)
    {
        $year=intval($val,10);
        if ($year<1924)
        {
            echo "Заданное число не может быть меньше 1924";
        }
        else
        {
            $year=$year-1924;
            $index=fmod($year,12);
            for ($i=0;$i<12;$i++)
            {
                if ((int)$index==$i)
                {
                    echo "Название года: " . $arr[$i];
                }
            }
        }
    }